snegovick/zephyr_modules_apm32/include/zephyr/dt-bindings/clock/apm32_clock_f0.h
/*
 * Copyright (c) 2023, Quincy.W <wangqyfm@foxmail.com>
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_APM32_CLOCK_F0_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_APM32_CLOCK_F0_H_


#define APM32_AHBPCLKEN_OFFSET 0x14
#define APM32_APB2PCLKEN_OFFSET 0x18
#define APM32_APB1PCLKEN_OFFSET 0x1c

#define APM32_CLOCK_DMA1 ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 0)	// RCM_AHBPCLKEN.0
#define APM32_CLOCK_DMA2 ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 1)	// RCM_AHBPCLKEN.1
#define APM32_CLOCK_SRAM ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 2)	// RCM_AHBPCLKEN.2
#define APM32_CLOCK_FMC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 4)	// RCM_AHBPCLKEN.4
#define APM32_CLOCK_CRC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 6)	// RCM_AHBPCLKEN.6

#define APM32_CLOCK_GPIOA ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 17) // RCM_AHBPCLKEN.17
#define APM32_CLOCK_GPIOB ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 18) // RCM_AHBPCLKEN.18
#define APM32_CLOCK_GPIOC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 19) // RCM_AHBPCLKEN.19
#define APM32_CLOCK_GPIOD ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 20) // RCM_AHBPCLKEN.20
#define APM32_CLOCK_GPIOE ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 21) // RCM_AHBPCLKEN.21
#define APM32_CLOCK_GPIOF ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 22) // RCM_AHBPCLKEN.22
#define APM32_CLOCK_TSC ((APM32_AHBPCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 24) // RCM_AHBPCLKEN.24

#define APM32_CLOCK_SYSCFG ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 0)	   // RCM_APB2PCLKEN.0
#define APM32_CLOCK_USART6 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 5)	   // RCM_APB2PCLKEN.5
#define APM32_CLOCK_USART7 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 6)	   // RCM_APB2PCLKEN.6
#define APM32_CLOCK_USART8 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 7)	   // RCM_APB2PCLKEN.7
#define APM32_CLOCK_ADC ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 9)	   // RCM_APB2PCLKEN.9
#define APM32_CLOCK_TIM1 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 11)	   // RCM_APB2PCLKEN.11
#define APM32_CLOCK_SPI1 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 12)	   // RCM_APB2PCLKEN.12
#define APM32_CLOCK_USART1 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 14)	   // RCM_APB2PCLKEN.14
#define APM32_CLOCK_TIM15 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 16)	   // RCM_APB2PCLKEN.16
#define APM32_CLOCK_TIM16 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 17)	   // RCM_APB2PCLKEN.17
#define APM32_CLOCK_TIM17 ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 18)	   // RCM_APB2PCLKEN.18
#define APM32_CLOCK_DBG ((APM32_APB2PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 22)	   // RCM_APB2PCLKEN.22

#define APM32_CLOCK_TIM2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 0)	   // RCM_APB1PCLKEN.0
#define APM32_CLOCK_TIM3 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 1)	   // RCM_APB1PCLKEN.1
#define APM32_CLOCK_TIM6 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 4)	   // RCM_APB1PCLKEN.4
#define APM32_CLOCK_TIM7 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 5)	   // RCM_APB1PCLKEN.5
#define APM32_CLOCK_TIM14 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 8)	   // RCM_APB1PCLKEN.8
#define APM32_CLOCK_WWDG ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 11)   // RCM_APB1PCLKEN.11
#define APM32_CLOCK_SPI2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 14)   // RCM_APB1PCLKEN.14
#define APM32_CLOCK_USART2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 17) // RCM_APB1PCLKEN.17
#define APM32_CLOCK_USART3 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 18) // RCM_APB1PCLKEN.18
#define APM32_CLOCK_USART4 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 19)  // RCM_APB1PCLKEN.19
#define APM32_CLOCK_USART5 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 20)  // RCM_APB1PCLKEN.20
#define APM32_CLOCK_I2C1 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 21)   // RCM_APB1PCLKEN.21
#define APM32_CLOCK_I2C2 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 22)   // RCM_APB1PCLKEN.22
#define APM32_CLOCK_CAN1 ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 25)   // RCM_APB1PCLKEN.25
#define APM32_CLOCK_CRS ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 27)	   // RCM_APB1PCLKEN.27
#define APM32_CLOCK_PMU ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 28)	   // RCM_APB1PCLKEN.28
#define APM32_CLOCK_DAC ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 29)	   // RCM_APB1PCLKEN.29
#define APM32_CLOCK_CEC ((APM32_APB1PCLKEN_OFFSET << APM32_CLOCK_REG_OFFSET) | 30)	   // RCM_APB1PCLKEN.30

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_APM32_CLOCK_F0_H_ */
